OpenNuvoton/M480BSP/Library/StdDriver/src/can.c
/**************************************************************************//**
 * @file     can.c
 * @version  V2.00
 * @brief    M480 series CAN driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2016-2020 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup CAN_Driver CAN Driver
  @{
*/

/** @addtogroup CAN_EXPORTED_FUNCTIONS CAN Exported Functions
  @{
*/

/** @cond HIDDEN_SYMBOLS */

#if defined(CAN2)
static uint8_t gu8LockCanIf[3ul][2ul] = {0ul};    /* The chip has three CANs. */
#elif defined(CAN1)
static uint8_t gu8LockCanIf[2ul][2ul] = {0ul};    /* The chip has two CANs. */
#elif defined(CAN0) || defined(CAN)
static uint8_t gu8LockCanIf[1ul][2ul] = {0ul};    /* The chip only has one CAN. */
#endif

#define RETRY_COUNTS    (0x10000000ul)

#define TSEG1_MIN 2ul
#define TSEG1_MAX 16ul
#define TSEG2_MIN 1ul
#define TSEG2_MAX 8ul
#define BRP_MIN   1ul
#define BRP_MAX   1024ul  /* 6-bit BRP field + 4-bit BRPE field*/
#define SJW_MAX   4ul
#define BRP_INC   1ul

/* #define DEBUG_PRINTF printf */
#define DEBUG_PRINTF(...)

static uint32_t LockIF(CAN_T *tCAN);
static uint32_t LockIF_TL(CAN_T *tCAN);
static void ReleaseIF(CAN_T *tCAN, uint32_t u32IfNo);
static int can_update_spt(int sampl_pt, int tseg, int *tseg1, int *tseg2);

/**
  * @brief Check if any interface is available then lock it for usage.
  * @param[in] tCAN The pointer to CAN module base address.
  * @retval 0 IF0 is free
  * @retval 1 IF1 is free
  * @retval 2 No IF is free
  * @details Search the first free message interface, starting from 0. If a interface is
  *          available, set a flag to lock the interface.
  */
static uint32_t LockIF(CAN_T *tCAN)
{
    uint32_t u32CanNo;
    uint32_t u32FreeIfNo;
    uint32_t u32IntMask;

#if defined(CAN1)
    if(tCAN == CAN0)
        u32CanNo = 0ul;
    else if(tCAN == CAN1)
        u32CanNo = 1ul;
    #if defined(CAN2)
    else if(tCAN == CAN2)
        u32CanNo = 2ul;
    #endif
#else /* defined(CAN0) || defined(CAN) */
    u32CanNo = 0ul;
#endif

    u32FreeIfNo = 2ul;

    /* Disable CAN interrupt */
    u32IntMask = tCAN->CON & (CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);
    tCAN->CON = tCAN->CON & ~(CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);

    /* Check interface 1 is available or not */
    if((tCAN->IF[0ul].CREQ & CAN_IF_CREQ_BUSY_Msk) == 0ul)
    {
        if(gu8LockCanIf[u32CanNo][0ul] == 0ul)
        {
            gu8LockCanIf[u32CanNo][0ul] = 1u;
            u32FreeIfNo = 0ul;
        }
        else
        {
        }
    }
    else
    {
    }

    /* Or check interface 2 is available or not */
    if(u32FreeIfNo == 2ul)
    {
        if((tCAN->IF[1ul].CREQ & CAN_IF_CREQ_BUSY_Msk) == 0ul)
        {
            if(gu8LockCanIf[u32CanNo][1ul] == 0ul)
            {
                gu8LockCanIf[u32CanNo][1ul] = 1u;
                u32FreeIfNo = 1ul;
            }
            else
            {
            }
        }
        else
        {
        }
    }
    else
    {
    }

    /* Enable CAN interrupt */
    tCAN->CON |= u32IntMask;

    return u32FreeIfNo;
}

/**
  * @brief Check if any interface is available in a time limitation then lock it for usage.
  * @param[in] tCAN The pointer to CAN module base address.
  * @retval 0 IF0 is free
  * @retval 1 IF1 is free
  * @retval 2 No IF is free
  * @details Search the first free message interface, starting from 0. If no interface is
  *          it will try again until time out. If a interface is available,  set a flag to
  *          lock the interface.
  */
static uint32_t LockIF_TL(CAN_T *tCAN)
{
    uint32_t u32Count;
    uint32_t u32FreeIfNo;

    for(u32Count = 0ul; u32Count < RETRY_COUNTS; u32Count++)
    {
        if((u32FreeIfNo = LockIF(tCAN)) != 2ul)
        {
            break;
        }
        else
        {
        }
    }

    return u32FreeIfNo;
}

/**
  * @brief Release locked interface.
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32Info The interface number, 0 or 1.
  * @return none
  * @details Release the locked interface.
  */
static void ReleaseIF(CAN_T *tCAN, uint32_t u32IfNo)
{
    uint32_t u32IntMask;
    uint32_t u32CanNo;

    if(u32IfNo >= 2ul)
    {
    }
    else
    {
#if defined(CAN1)
    if(tCAN == CAN0)
        u32CanNo = 0ul;
    else if(tCAN == CAN1)
        u32CanNo = 1ul;
    #if defined(CAN2)
    else if(tCAN == CAN2)
        u32CanNo = 2ul;
    #endif
#else /* defined(CAN0) || defined(CAN) */
        u32CanNo = 0ul;
#endif

        /* Disable CAN interrupt */
        u32IntMask = tCAN->CON & (CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);
        tCAN->CON = tCAN->CON & ~(CAN_CON_IE_Msk | CAN_CON_SIE_Msk | CAN_CON_EIE_Msk);

        gu8LockCanIf[u32CanNo][u32IfNo] = 0u;

        /* Enable CAN interrupt */
        tCAN->CON |= u32IntMask;
    }
}

static int can_update_spt(int sampl_pt, int tseg, int *tseg1, int *tseg2)
{
    *tseg2 = tseg + 1 - (sampl_pt * (tseg + 1)) / 1000;
    if (*tseg2 < TSEG2_MIN)
    {
        *tseg2 = TSEG2_MIN;
    }
    else
    {
    }

    if (*tseg2 > TSEG2_MAX)
    {
        *tseg2 = TSEG2_MAX;
    }
    else
    {
    }

    *tseg1 = tseg - *tseg2;
    if (*tseg1 > TSEG1_MAX)
    {
        *tseg1 = TSEG1_MAX;
        *tseg2 = tseg - *tseg1;
    }
    else
    {
    }

    return 1000 * (tseg + 1 - *tseg2) / (tseg + 1);
}

/** @endcond HIDDEN_SYMBOLS */

/**
  * @brief Enter initialization mode
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u8Mask Following values can be used.
  *            \ref CAN_CON_DAR_Msk Disable automatic retransmission.
  *            \ref CAN_CON_EIE_Msk Enable error interrupt.
  *            \ref CAN_CON_SIE_Msk Enable status interrupt.
  *            \ref CAN_CON_IE_Msk CAN interrupt.
  * @return None
  * @details This function is used to set CAN to enter initialization mode and enable access bit timing
  *          register. After bit timing configuration ready, user must call CAN_LeaveInitMode()
  *          to leave initialization mode and lock bit timing register to let new configuration
  *          take effect.
  */
void CAN_EnterInitMode(CAN_T *tCAN, uint8_t u8Mask)
{
    tCAN->CON = u8Mask | (CAN_CON_INIT_Msk | CAN_CON_CCE_Msk);
}


/**
  * @brief Leave initialization mode
  * @param[in] tCAN The pointer to CAN module base address.
  * @return None
  * @details This function is used to set CAN to leave initialization mode to let
  *          bit timing configuration take effect after configuration ready.
  */
void CAN_LeaveInitMode(CAN_T *tCAN)
{
    uint32_t u32TimeOutCount = SystemCoreClock; // 1 second timeout
    tCAN->CON &= (~(CAN_CON_INIT_Msk | CAN_CON_CCE_Msk));
    while(tCAN->CON & CAN_CON_INIT_Msk) /* Check INIT bit is released */
    {
        if(u32TimeOutCount == 0) break;
        u32TimeOutCount--;
    }
}

/**
  * @brief Wait message into message buffer in basic mode.
  * @param[in] tCAN The pointer to CAN module base address.
  * @return None
  * @details This function is used to wait message into message buffer in basic mode. Please notice the
  *          function is polling NEWDAT bit of MCON register by while loop and it is used in basic mode.
  */
void CAN_WaitMsg(CAN_T *tCAN)
{
    tCAN->STATUS = 0x0ul; /* clr status */

    while(1)
    {
        if(tCAN->IF[1].MCON & CAN_IF_MCON_NEWDAT_Msk)   /* check new data */
        {
            /* New Data IN */
            break;
        }
        else
        {
        }

        if(tCAN->STATUS & CAN_STATUS_RXOK_Msk)
        {
            /* Rx OK */
        }
        else
        {
        }

