OpenNuvoton/M480BSP/Library/StdDriver/src/can.c
    if((tCAN->IF[1].MCON & CAN_IF_MCON_NEWDAT_Msk) == 0ul)
    {
        /* In basic mode, receive data always save in IF2 */
        rev = 0; /* return FALSE */
    }
    else
    {

        tCAN->STATUS &= (~CAN_STATUS_RXOK_Msk);

        tCAN->IF[1].CMASK = CAN_IF_CMASK_ARB_Msk
                            | CAN_IF_CMASK_CONTROL_Msk
                            | CAN_IF_CMASK_DATAA_Msk
                            | CAN_IF_CMASK_DATAB_Msk;

        if((tCAN->IF[1].ARB2 & CAN_IF_ARB2_XTD_Msk) == 0ul)
        {
            /* standard ID*/
            pCanMsg->IdType = CAN_STD_ID;
            pCanMsg->Id = (tCAN->IF[1].ARB2 >> 2) & 0x07FFul;

        }
        else
        {
            /* extended ID*/
            pCanMsg->IdType = CAN_EXT_ID;
            pCanMsg->Id  = (tCAN->IF[1].ARB2 & 0x1FFFul) << 16;
            pCanMsg->Id |= (uint32_t)tCAN->IF[1].ARB1;
        }

        pCanMsg->FrameType = (((tCAN->IF[1].ARB2 & CAN_IF_ARB2_DIR_Msk) >> CAN_IF_ARB2_DIR_Pos)) ? 0ul : 1ul;

        pCanMsg->DLC     = (uint8_t)(tCAN->IF[1].MCON & CAN_IF_MCON_DLC_Msk);
        pCanMsg->Data[0] = (uint8_t)(tCAN->IF[1].DAT_A1 & CAN_IF_DAT_A1_DATA0_Msk);
        pCanMsg->Data[1] = (uint8_t)((tCAN->IF[1].DAT_A1 & CAN_IF_DAT_A1_DATA1_Msk) >> CAN_IF_DAT_A1_DATA1_Pos);
        pCanMsg->Data[2] = (uint8_t)(tCAN->IF[1].DAT_A2 & CAN_IF_DAT_A2_DATA2_Msk);
        pCanMsg->Data[3] = (uint8_t)((tCAN->IF[1].DAT_A2 & CAN_IF_DAT_A2_DATA3_Msk) >> CAN_IF_DAT_A2_DATA3_Pos);
        pCanMsg->Data[4] = (uint8_t)(tCAN->IF[1].DAT_B1 & CAN_IF_DAT_B1_DATA4_Msk);
        pCanMsg->Data[5] = (uint8_t)((tCAN->IF[1].DAT_B1 & CAN_IF_DAT_B1_DATA5_Msk) >> CAN_IF_DAT_B1_DATA5_Pos);
        pCanMsg->Data[6] = (uint8_t)(tCAN->IF[1].DAT_B2 & CAN_IF_DAT_B2_DATA6_Msk);
        pCanMsg->Data[7] = (uint8_t)((tCAN->IF[1].DAT_B2 & CAN_IF_DAT_B2_DATA7_Msk) >> CAN_IF_DAT_B2_DATA7_Pos);
    }

    return rev;
}

/**
  * @brief Set Rx message object, include ID mask.
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u8MsgObj Specifies the Message object number, from 0 to 31.
  * @param[in] u8idType Specifies the identifier type of the frames that will be transmitted
  *                     This parameter can be one of the following values:
  *                     \ref CAN_STD_ID (standard ID, 11-bit)
  *                     \ref CAN_EXT_ID (extended ID, 29-bit)
  * @param[in] u32id Specifies the identifier used for acceptance filtering.
  * @param[in] u32idmask Specifies the identifier mask used for acceptance filtering.
  *                     \ref CAN_STD_ID_MASK
  *                     \ref CAN_EXT_ID_MASK
  *                     \ref CAN_MASK_MSG_DIR
  *                     \ref CAN_MASK_EXT_ID_BIT
  * @param[in] u8singleOrFifoLast Specifies the end-of-buffer indicator.
  *                               This parameter can be one of the following values:
  *                               TRUE: for a single receive object or a FIFO receive object that is the last one of the FIFO.
  *                               FALSE: for a FIFO receive object that is not the last one.
  * @retval TRUE SUCCESS
  * @retval FALSE No useful interface
  * @details The function is used to configure a receive message object.
  */
int32_t CAN_SetRxMsgObjAndMsk(CAN_T *tCAN, uint8_t u8MsgObj, uint8_t u8idType, uint32_t u32id, uint32_t u32idmask, uint8_t u8singleOrFifoLast)
{
    int32_t rev = 1l;
    uint32_t u32MsgIfNum;

    /* Get and lock a free interface */
    if((u32MsgIfNum = LockIF_TL(tCAN)) == 2ul)
    {
        rev = 0; /* return FALSE */
    }
    else
    {
        /* Command Setting */
        tCAN->IF[u32MsgIfNum].CMASK = CAN_IF_CMASK_WRRD_Msk | CAN_IF_CMASK_MASK_Msk | CAN_IF_CMASK_ARB_Msk |
                                      CAN_IF_CMASK_CONTROL_Msk | CAN_IF_CMASK_DATAA_Msk | CAN_IF_CMASK_DATAB_Msk;

        if(u8idType == CAN_STD_ID)    /* According STD/EXT ID format,Configure Mask and Arbitration register */
        {
            tCAN->IF[u32MsgIfNum].ARB1 = 0ul;
            tCAN->IF[u32MsgIfNum].ARB2 = CAN_IF_ARB2_MSGVAL_Msk | (u32id & 0x7FFul) << 2;
        }
        else
        {
            tCAN->IF[u32MsgIfNum].ARB1 = u32id & 0xFFFFul;
            tCAN->IF[u32MsgIfNum].ARB2 = CAN_IF_ARB2_MSGVAL_Msk | CAN_IF_ARB2_XTD_Msk | (u32id & 0x1FFF0000ul) >> 16;
        }

        tCAN->IF[u32MsgIfNum].MASK1 = (u32idmask & 0xFFFFul);
        tCAN->IF[u32MsgIfNum].MASK2 = (u32idmask >> 16) & 0xFFFFul;

        /* tCAN->IF[u32MsgIfNum].MCON |= CAN_IF_MCON_UMASK_Msk | CAN_IF_MCON_RXIE_Msk; */
        tCAN->IF[u32MsgIfNum].MCON = CAN_IF_MCON_UMASK_Msk | CAN_IF_MCON_RXIE_Msk;
        if(u8singleOrFifoLast)
        {
            tCAN->IF[u32MsgIfNum].MCON |= CAN_IF_MCON_EOB_Msk;
        }
        else
        {
            tCAN->IF[u32MsgIfNum].MCON &= (~CAN_IF_MCON_EOB_Msk);
        }

        tCAN->IF[u32MsgIfNum].DAT_A1  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_A2  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_B1  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_B2  = 0ul;

        tCAN->IF[u32MsgIfNum].CREQ = 1ul + u8MsgObj;
        ReleaseIF(tCAN, u32MsgIfNum);
    }

    return rev;
}

/**
  * @brief Set Rx message object
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u8MsgObj Specifies the Message object number, from 0 to 31.
  * @param[in] u8idType Specifies the identifier type of the frames that will be transmitted
  *                     This parameter can be one of the following values:
  *                     \ref CAN_STD_ID (standard ID, 11-bit)
  *                     \ref CAN_EXT_ID (extended ID, 29-bit)
  * @param[in] u32id Specifies the identifier used for acceptance filtering.
  * @param[in] u8singleOrFifoLast Specifies the end-of-buffer indicator.
  *                               This parameter can be one of the following values:
  *                               TRUE: for a single receive object or a FIFO receive object that is the last one of the FIFO.
  *                               FALSE: for a FIFO receive object that is not the last one.
  * @retval TRUE SUCCESS
  * @retval FALSE No useful interface
  * @details The function is used to configure a receive message object.
  */
int32_t CAN_SetRxMsgObj(CAN_T *tCAN, uint8_t u8MsgObj, uint8_t u8idType, uint32_t u32id, uint8_t u8singleOrFifoLast)
{
    int32_t rev = 1l;
    uint32_t u32MsgIfNum;

    /* Get and lock a free interface */
    if((u32MsgIfNum = LockIF_TL(tCAN)) == 2ul)
    {
        rev = 0; /* return FALSE */
    }
    else
    {
        /* Command Setting */
        tCAN->IF[u32MsgIfNum].CMASK = CAN_IF_CMASK_WRRD_Msk | CAN_IF_CMASK_MASK_Msk | CAN_IF_CMASK_ARB_Msk |
                                      CAN_IF_CMASK_CONTROL_Msk | CAN_IF_CMASK_DATAA_Msk | CAN_IF_CMASK_DATAB_Msk;

