OpenNuvoton/M480BSP/Library/StdDriver/src/can.c
        if(u8idType == CAN_STD_ID)    /* According STD/EXT ID format,Configure Mask and Arbitration register */
        {
            tCAN->IF[u32MsgIfNum].ARB1 = 0ul;
            tCAN->IF[u32MsgIfNum].ARB2 = CAN_IF_ARB2_MSGVAL_Msk | (u32id & 0x7FFul) << 2;
        }
        else
        {
            tCAN->IF[u32MsgIfNum].ARB1 = u32id & 0xFFFFul;
            tCAN->IF[u32MsgIfNum].ARB2 = CAN_IF_ARB2_MSGVAL_Msk | CAN_IF_ARB2_XTD_Msk | (u32id & 0x1FFF0000ul) >> 16;
        }

        /* tCAN->IF[u8MsgIfNum].MCON |= CAN_IF_MCON_UMASK_Msk | CAN_IF_MCON_RXIE_Msk; */
        tCAN->IF[u32MsgIfNum].MCON = CAN_IF_MCON_UMASK_Msk | CAN_IF_MCON_RXIE_Msk;
        if(u8singleOrFifoLast)
        {
            tCAN->IF[u32MsgIfNum].MCON |= CAN_IF_MCON_EOB_Msk;
        }
        else
        {
            tCAN->IF[u32MsgIfNum].MCON &= (~CAN_IF_MCON_EOB_Msk);
        }

        tCAN->IF[u32MsgIfNum].DAT_A1  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_A2  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_B1  = 0ul;
        tCAN->IF[u32MsgIfNum].DAT_B2  = 0ul;

        tCAN->IF[u32MsgIfNum].CREQ = 1ul + u8MsgObj;
        ReleaseIF(tCAN, u32MsgIfNum);
    }

    return rev;
}

/**
  * @brief Gets the message
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u8MsgObj Specifies the Message object number, from 0 to 31.
  * @param[in] u8Release Specifies the message release indicator.
  *                      This parameter can be one of the following values:
  *                      TRUE: the message object is released when getting the data.
  *                      FALSE:the message object is not released.
  * @param[in] pCanMsg Pointer to the message structure where received data is copied.
  * @retval TRUE Success
  * @retval FALSE No any message received
  * @retval -1 Read Message Fail
  * @details Gets the message, if received.
  */
int32_t CAN_ReadMsgObj(CAN_T *tCAN, uint8_t u8MsgObj, uint8_t u8Release, STR_CANMSG_T* pCanMsg)
{
    int32_t rev = 1l;
    uint32_t u32MsgIfNum;
    uint32_t u32TimeOutCount = SystemCoreClock * 2; // 2 second timeout

    if(!CAN_IsNewDataReceived(tCAN, u8MsgObj))
    {
        rev = 0; /* return FALSE */
    }
    else
    {
        /* Get and lock a free interface */
        if((u32MsgIfNum = LockIF_TL(tCAN)) == 2ul)
        {
            rev = 0; /* return FALSE */
        }
        else
        {
            tCAN->STATUS &= (~CAN_STATUS_RXOK_Msk);

            /* read the message contents*/
            tCAN->IF[u32MsgIfNum].CMASK = CAN_IF_CMASK_MASK_Msk
                                          | CAN_IF_CMASK_ARB_Msk
                                          | CAN_IF_CMASK_CONTROL_Msk
                                          | CAN_IF_CMASK_CLRINTPND_Msk
                                          | (u8Release ? CAN_IF_CMASK_TXRQSTNEWDAT_Msk : 0ul)
                                          | CAN_IF_CMASK_DATAA_Msk
                                          | CAN_IF_CMASK_DATAB_Msk;

            tCAN->IF[u32MsgIfNum].CREQ = 1ul + u8MsgObj;

            while(tCAN->IF[u32MsgIfNum].CREQ & CAN_IF_CREQ_BUSY_Msk) /*Wait*/
            {
                if(u32TimeOutCount == 0)
                {
                    ReleaseIF(tCAN, u32MsgIfNum);
                    return -1;
                }
                u32TimeOutCount--;
            }

            if((tCAN->IF[u32MsgIfNum].ARB2 & CAN_IF_ARB2_XTD_Msk) == 0ul)
            {
                /* standard ID*/
                pCanMsg->IdType = CAN_STD_ID;
                pCanMsg->Id     = (tCAN->IF[u32MsgIfNum].ARB2 & CAN_IF_ARB2_ID_Msk) >> 2ul;
            }
            else
            {
                /* extended ID*/
                pCanMsg->IdType = CAN_EXT_ID;
                pCanMsg->Id  = (((tCAN->IF[u32MsgIfNum].ARB2) & 0x1FFFul) << 16) | tCAN->IF[u32MsgIfNum].ARB1;
            }

            pCanMsg->DLC     = (uint8_t)(tCAN->IF[u32MsgIfNum].MCON & CAN_IF_MCON_DLC_Msk);
            pCanMsg->Data[0] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_A1 & CAN_IF_DAT_A1_DATA0_Msk);
            pCanMsg->Data[1] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_A1 & CAN_IF_DAT_A1_DATA1_Msk) >> CAN_IF_DAT_A1_DATA1_Pos);
            pCanMsg->Data[2] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_A2 & CAN_IF_DAT_A2_DATA2_Msk);
            pCanMsg->Data[3] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_A2 & CAN_IF_DAT_A2_DATA3_Msk) >> CAN_IF_DAT_A2_DATA3_Pos);
            pCanMsg->Data[4] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_B1 & CAN_IF_DAT_B1_DATA4_Msk);
            pCanMsg->Data[5] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_B1 & CAN_IF_DAT_B1_DATA5_Msk) >> CAN_IF_DAT_B1_DATA5_Pos);
            pCanMsg->Data[6] = (uint8_t)(tCAN->IF[u32MsgIfNum].DAT_B2 & CAN_IF_DAT_B2_DATA6_Msk);
            pCanMsg->Data[7] = (uint8_t)((tCAN->IF[u32MsgIfNum].DAT_B2 & CAN_IF_DAT_B2_DATA7_Msk) >> CAN_IF_DAT_B2_DATA7_Pos);

            ReleaseIF(tCAN, u32MsgIfNum);
        }
    }

    return rev;
}


/**
  * @brief Set bus baud-rate.
  *
  * @param[in] tCAN The pointer to CAN module base address.
  * @param[in] u32BaudRate The target CAN baud-rate. The range of u32BaudRate is 1~1000KHz.
  *
  * @return u32CurrentBitRate  Real baud-rate value.
  *
  * @details The function is used to set bus timing parameter according current clock and target baud-rate.
  */
uint32_t CAN_SetBaudRate(CAN_T *tCAN, uint32_t u32BaudRate)
{
    long rate;
    long best_error = 1000000000, error = 0;
    int best_tseg = 0, best_brp = 0, brp = 0;
    int tsegall, tseg = 0, tseg1 = 0, tseg2 = 0;
    int spt_error = 1000, spt = 0, sampl_pt;
    uint64_t clock_freq = (uint64_t)0, u64PCLK_DIV = (uint64_t)1;
    uint32_t sjw = (uint32_t)SJW_MAX;

    CAN_EnterInitMode(tCAN, (uint8_t)0);

    SystemCoreClockUpdate();
    if((tCAN == CAN0) || (tCAN == CAN2))
    {
        u64PCLK_DIV = (uint64_t)(CLK->PCLKDIV & CLK_PCLKDIV_APB0DIV_Msk);
        u64PCLK_DIV = (uint64_t)(1 << u64PCLK_DIV);
    }
    else if(tCAN == CAN1)
    {
        u64PCLK_DIV = (uint64_t)((CLK->PCLKDIV & CLK_PCLKDIV_APB1DIV_Msk) >> CLK_PCLKDIV_APB1DIV_Pos);
        u64PCLK_DIV = (uint64_t)(1 << u64PCLK_DIV);
    }

    clock_freq = SystemCoreClock / u64PCLK_DIV;

